Documents/ra_ZayavkaNaOcenkuSootvetstviya2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ra_ZayavkaNaOcenkuSootvetstviya2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.del_ра_ОборотыПоказателейОтчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FormaOS</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_FormyOcenkiSootvetstviya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Proekt</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataRegistracii</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataZayavki</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegNomer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SkhemaSertifikacii</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_SkhemySertifikacii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SkhemaSertifikaciiProdukcii</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_SkhemySertifikacii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidZayavkiNaExpertizuTD</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_VidyZayavokNaExpertizuTD</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InformaciyaObObekteOcenkiSootvetstviya</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaObektAttestacionnyhIspytanij</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_ObektyAttestacionnyhIspytanij</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaProdukciya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_MTRiO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaTekhnologicheskieSistemy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_TekhnologicheskieSistemy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaTekhDocs</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerechenProdukciiPo277Prikazu</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_PerechenProdukciiPo277Prikazu</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PredlagaemayaZayavitelemSkhemaSertifikacii</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_SkhemySertifikacii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GID_MTRIO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KKS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KodOKPD2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_OKPD2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KharakterProizvodstva</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_KharakterVypuskaProdukcii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KlassBezopasnosti</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_KlassyBezopasnosti</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZavodskojNomer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataTU_TT</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidProdukciiPoGostu</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_VidyProdukciiPoGostu</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidProdukciiVSootvetstviiSNP_071_18</Name>
					<Type>
						<v8:Type>cfg:EnumRef.del_ra_VidyProdukciiVSootvetstviiSNP_071_18</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DogovorPostavki</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_Dogovory</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NomerPlanaKachestva</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EkspluatiruyushchayaOrganizaciya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Izgotovitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Razrabotchik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RukovoditelRazrabotchik</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ispolnitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RukovoditelIspolnitel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Zayavitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostRukovoditelyaOrganizaciiZayavitelyaNaEkspertizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostUpolnomochennogoLicaOtZayavitelyaNaEkspretizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RukovoditelOrganizaciiZayavitelyaNaEkspertizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpolnomochennoeLicoOtZayavitelyaNaEkspertizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ObektyOcenkiSootvetstviyaTD</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NaimenovanieObekta</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SeriynieNomera</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SerijnyjNomer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ElementyObektaOcenkiSootvetstviya</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NaimenovanieObekta</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ra_FormyOcenkiSootvetstviya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ra_FormyOcenkiSootvetstviya</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AttestacionnyeIspytaniya</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EkspertizaTD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PoryadokObyazatelnojSertifikacii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InspekcionnyjKontrol</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Priemka</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReshenieOPrimeneniiImportnojProdukcii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Registraciya</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ra_ZayavkaNaOcenkuSootvetstviya2/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ра_ОбщегоНазначения.ЗаполнитьВидДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	DataRegistracii = НачалоДня(ТекущаяДата());
	Ispolnitel = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ра_Организация");
	
	Если FormaOS = Перечисления.ra_FormyOcenkiSootvetstviya.PoryadokObyazatelnojSertifikacii Тогда 
		VidProdukciiVSootvetstviiSNP_071_18 = Перечисления.ra_VidyProdukciiVSootvetstviiSNP_071_18.K;
	КонецЕсли;
	
	Если FormaOS = Перечисления.ra_FormyOcenkiSootvetstviya.Priemka Тогда
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ispolnitel, "ра_СпециализированнаяОрганизация,ра_ЭксплуатирующаяОрганизация");
		Если НЕ СтруктураРеквизитов["ра_СпециализированнаяОрганизация"]
				И НЕ СтруктураРеквизитов["ра_ЭксплуатирующаяОрганизация"]
				И Ссылка.Пустая() Тогда
			ВызватьИсключение НСтр("ru = 'Автор не числится в эксплуатирующей или в специализированной организации'; en = 'User is not associated to operating or specialized organization'");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Документы.ra_ZayavkaNaOcenkuSootvetstviya2.АктуализироватьМассивОбязательныхРеквизитов(ПроверяемыеРеквизиты, ЭтотОбъект);
	
	Если DataZayavki > DataRegistracii И (ЗначениеЗаполнено(DataZayavki) И ЗначениеЗаполнено(DataRegistracii)) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата регистрации не может быть раньше даты заявки'; en = 'Registration date must be later than the application date'"), , "DataZayavki", , Отказ)
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//// ТСК Близнюк С.И.; 09.10.2018; task#1373{
	//Если ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности() Тогда
	//	ВремяНачала = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени();
	//	ДополнительныеСвойства.Вставить("ВремяНачала", ВремяНачала);	
	//КонецЕсли;
	//// ТСК Близнюк С.И.; 09.10.2018; task#1373}
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ра_ОбщегоНазначения.ДокументыКачестваПередЗаписью(ЭтотОбъект);
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ДополнительныеСвойства.Свойство("НужноПометитьНаУдалениеБизнесСобытия") Тогда
	//	БизнесСобытияВызовСервера.ПометитьНаУдалениеСобытияПоИсточнику(Ссылка);
	//КонецЕсли;
	//
	//// ТСК Корнюшенков А.Ю. 28.06.2018 {
	//// настройка автозапуска процессов для документа "Уведомление о несоответствии"
	//// Возможно, выполнена явная регистрация событий при загрузке объекта.
	//Если Не ДополнительныеСвойства.Свойство("НеРегистрироватьБизнесСобытия") Тогда
	//	Если ДополнительныеСвойства.ЭтоНовый Тогда
	//		БизнесСобытияВызовСервера.ЗарегистрироватьСобытие(Ссылка, Справочники.ВидыБизнесСобытий.СозданиеВнутреннегоДокумента);
	//	Иначе
	//		Если НЕ ра_ОбщегоНазначения.ЕстьБизнесПроцессыПоДокументу(Ссылка) Тогда
	//			БизнесСобытияВызовСервера.ЗарегистрироватьСобытие(Ссылка, Справочники.ВидыБизнесСобытий.ИзменениеВнутреннегоДокумента);
	//			ДополнительныеСвойства.Вставить("СтартВыполнен", Истина);
	//			ДополнительныеСвойства.Вставить("Описание", "ok");
	//		Иначе
	//			ДополнительныеСвойства.Вставить("СтартВыполнен", Ложь);
	//			ДополнительныеСвойства.Вставить("Описание", НСтр("ru = 'Не запущен процесс согласования измененного уведомления, т.к. есть предыдущие незавершенные бизнес-процесы.'; en = 'The start of the business process is canceled. There are unfinished business processes.'"));
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//// ТСК Корнюшенков А.Ю. 28.06.2018 }
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьУчастниковРабочейГруппыВНабор(ТаблицаНабора) Экспорт
	
	Организации = Новый Массив;
	Организации.Добавить(EkspluatiruyushchayaOrganizaciya);
	Организации.Добавить(Ispolnitel);
	Организации.Добавить(Izgotovitel);
	Организации.Добавить(Zayavitel);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ра_Организация В(&Организации)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(ТаблицаНабора, Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
